module Algorithms
  module LinkedStack
=begin
  LeetCode 20：
  给一个只包含 ( ) { } [ ] 的字符串 s，判断这个字符串是不是“有效的”：
  任意左括号，都必须由同类型的右括号闭合；
  括号必须正确嵌套，不能交叉；
  比如：
  ✅ “()”, “()[]{}”, “{[]}”
  ❌ “(]”, “([)]”, “(”, “(((”
  所以我们要做的，就是判断匹配 & 嵌套是否正确。

  思路：
  1.  遇到左括号：( [ {
      👉 压栈（push）
  2.  遇到右括号：) ] }
      👉 必须和`栈顶`那个左括号匹配：
      - 如果栈是空的：说明当前右括号没有对应的左括号 → 直接返回 false
      - 如果栈不空：弹出栈顶，如果类型不匹配 → 返回 false
  3.  扫描完字符串后：
      - 如果栈是空的 → 所有左括号都刚好被匹配 → 返回 true
      - 如果栈不空 → 说明有多余的左括号 → 返回 false
  为什么用栈？
  - 括号的匹配是后进先出（LIFO）的结构：
      - `({[]})` 里最早出现的左括号 (，是最后才被 ) 关上的。
      - 最后进去的 [，最先被 ] 关掉。
  - 这正好就是栈的行为模式：最后压进来的，最先弹出去。
=end

    def valid_parentheses?(s)
      stack = Stack.new
      mapping = { ')' => '(', ']' => '[', '}' => '{' }

      s.each_char do |char|
        if mapping.values.include?(char)
          # 左括号，压栈
          stack.push(char)
        elsif mapping.keys.include?(char)
          # 右括号，检查匹配
          return false if stack.empty?

          top = stack.pop
          return false if top != mapping[char]
        end
      end

      stack.empty?
    end

  end
end